app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 18]]
---
                    <div class="comment-count">
		    	        <span class="tag is-rounded"><%= post.comments.count %> comments </span>