app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "comment", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?, ?)  [["name", "Harish"], ["comment", "This is a nice blog"], ["created_at", "2022-09-21 03:48:14.980740"], ["updated_at", "2022-09-21 03:48:14.980740"], ["post_id", 13]]
---
    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.create(params[:comment].permit(:name, :comment))