app/controllers/posts_controller.rb

    def update

        if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Number 4 Post"], ["content", "post is no 4"], ["updated_at", "2022-09-19 13:07:53.185976"], ["id", 4]]